In [1]:
import pandas as pd

# Explore Cities dataset

In [2]:
city_df = pd.read_csv('city_data_table.csv')
city_df.head()

   year     city        country  avg_temp
0  1849  Abidjan  Côte D'Ivoire     25.58
1  1850  Abidjan  Côte D'Ivoire     25.52
2  1851  Abidjan  Côte D'Ivoire     25.67
3  1852  Abidjan  Côte D'Ivoire       NaN
4  1853  Abidjan  Côte D'Ivoire       NaN

- We have 71311 - 68764 = 2547 null values in `avg_temp` column
- which is about 3.5% of the data

In [6]:
city_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71311 entries, 0 to 71310
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      71311 non-null  int64
 1   city      71311 non-null  object
 2   country   71311 non-null  object
 3   avg_temp  68764 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.2+ MB

In [31]:
print("Number of cities in each country:")
city_df.groupby('country')['city'].nunique().sort_values(ascending = False)

Number of cities in each country:

country
United States    52
China            34
India            22
Brazil           11
Russia            9
                 ..
Tunisia           1
Uzbekistan        1
Uruguay           1
Zambia            1
Zimbabwe          1
Name: city, Length: 137, dtype: int64

In [57]:
city_df[city_df["avg_temp"].isna()].count()

year        2547
city        2547
country     2547
avg_temp       0
dtype: int64

In [64]:
city_df[city_df["avg_temp"].isna()].groupby(["country", "city"])['year'].count().sort_values(ascending = False)\
                                                                        .rename("missing_gap_count").reset_index()

                country              city  missing_gap_count
0             Mauritius        Port Louis                 85
1            Madagascar      Antananarivo                 77
2         United States       New Orleans                 45
3         United States            Denver                 43
4         United States  Colorado Springs                 43
..                  ...               ...                ...
238  Dominican Republic          Santiago                  1
239               China           Tianjin                  1
240               China          Tangshan                  1
241               China          Shenyang                  1
242               China            Anshan                  1

[243 rows x 3 columns]

In [66]:
city_df.groupby(["country", "city"])['year'].count().sort_values(ascending = False)\
                                                    .rename("years_count").reset_index()

              country           city  years_count
0             Albania         Tirana          271
1       United States   Philadelphia          271
2       United States        Raleigh          271
3       United States    Minneapolis          271
4       United States      Milwaukee          271
..                ...            ...          ...
340           Ecuador  Santo Domingo          155
341           Eritrea         Asmara          150
342              Peru           Lima          133
343           Ecuador      Guayaquil          133
344  Papua New Guinea   Port Moresby          132

[345 rows x 3 columns]

In [73]:
city_df.groupby(["country", "city"])['year'].agg(
    start_year  = 'min',
    end_year    = 'max',
    years_count = 'count',
).reset_index()

         country              city  start_year  end_year  years_count
0    Afghanistan             Kabul        1833      2013          181
1        Albania            Tirana        1743      2013          271
2        Algeria           Algiers        1753      2013          261
3         Angola            Luanda        1856      2013          158
4      Argentina           Cordoba        1855      2013          159
..           ...               ...         ...       ...          ...
340    Venezuela          Valencia        1824      2013          190
341      Vietnam             Hanoi        1840      2013          174
342      Vietnam  Ho Chi Minh City        1825      2013          189
343       Zambia            Lusaka        1850      2013          164
344     Zimbabwe            Harare        1850      2013          164

[345 rows x 5 columns]

In [74]:
city_df.groupby(["country", "city"])['year'].agg(
    start_year  = 'min',
    end_year    = 'max',
    years_count = 'count',
).reset_index().describe()

        start_year  end_year  years_count
count   345.000000     345.0   345.000000
mean   1807.301449    2013.0   206.698551
std      42.476076       0.0    42.476076
min    1743.000000    2013.0   132.000000
25%    1755.000000    2013.0   173.000000
50%    1824.000000    2013.0   190.000000
75%    1841.000000    2013.0   259.000000
max    1882.000000    2013.0   271.000000

In [76]:
city_df[city_df['year'] >= 1882].groupby(["country", "city"])['year'].agg(
    start_year  = 'min',
    end_year    = 'max',
    years_count = 'count',
).reset_index().describe()

       start_year  end_year  years_count
count       345.0     345.0        345.0
mean       1882.0    2013.0        132.0
std           0.0       0.0          0.0
min        1882.0    2013.0        132.0
25%        1882.0    2013.0        132.0
50%        1882.0    2013.0        132.0
75%        1882.0    2013.0        132.0
max        1882.0    2013.0        132.0

In [85]:
city_df[city_df['year'] >= 1882].info()

<class 'pandas.core.frame.DataFrame'>
Index: 45540 entries, 33 to 71310
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      45540 non-null  int64
 1   city      45540 non-null  object
 2   country   45540 non-null  object
 3   avg_temp  45499 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 1.7+ MB

In [17]:
print("Date range:")
print("start date:", city_df['year'].min(), ", end date:", city_df['year'].max())

Date range:
start date: 1743 , end date: 2013

In [4]:
city_df['city'].describe()

count          71311
unique           332
top       Birmingham
freq             542
Name: city, dtype: object

In [5]:
city_df['country'].describe()

count             71311
unique              137
top       United States
freq              11973
Name: country, dtype: object